In [ ]:
import numpy as np
import pandas as pd

# Data Wrangling: Clean, Transform, Merge, Reshape

- Much of the programming work in data analysis and modeling is spent on data preparation
    - loading, cleaning, transforming, and rearranging.
    -  the way that data is stored in files or databases is not the way you need it.
- Fortunately, pandas along with the Python standard library provide you with a high-level, flexible, and high-performance set of core manipulations and algorithms to enable you to wrangle data into the right form without much trouble.

## Hierarchical Indexing

- Hierarchical indexing  enables you to have multiple (two or more) index levels on an axis.

In [2]:
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1   -0.043705
   2    0.111132
   3   -0.315918
b  1    2.004142
   3   -0.290211
c  1    0.271515
   2    0.069990
d  2   -1.181587
   3   -1.229886
dtype: float64

In [3]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

- partial indexing

In [4]:
data["a"]

1   -0.043705
2    0.111132
3   -0.315918
dtype: float64

In [5]:
data["b"]

1    2.004142
3   -0.290211
dtype: float64

In [6]:
data["b":"d"]

b  1    2.004142
   3   -0.290211
c  1    0.271515
   2    0.069990
d  2   -1.181587
   3   -1.229886
dtype: float64

In [7]:
data[["b","d"]]

b  1    2.004142
   3   -0.290211
d  2   -1.181587
   3   -1.229886
dtype: float64

In [8]:
data

a  1   -0.043705
   2    0.111132
   3   -0.315918
b  1    2.004142
   3   -0.290211
c  1    0.271515
   2    0.069990
d  2   -1.181587
   3   -1.229886
dtype: float64

In [9]:
data[:,3]

a   -0.315918
b   -0.290211
d   -1.229886
dtype: float64

<img src="https://drive.google.com/uc?id=1e5Qd4sSQvwu-4lKQHpn8IEeDR4CVs_Ns" width="60%" allow="autoplay"></img>

In [10]:
data

a  1   -0.043705
   2    0.111132
   3   -0.315918
b  1    2.004142
   3   -0.290211
c  1    0.271515
   2    0.069990
d  2   -1.181587
   3   -1.229886
dtype: float64

In [11]:
data.unstack()

          1         2         3
a -0.043705  0.111132 -0.315918
b  2.004142       NaN -0.290211
c  0.271515  0.069990       NaN
d       NaN -1.181587 -1.229886

In [12]:
dataDF = data.unstack()
type(dataDF)

pandas.core.frame.DataFrame

In [13]:
dataDF.stack()

a  1   -0.043705
   2    0.111132
   3   -0.315918
b  1    2.004142
   3   -0.290211
c  1    0.271515
   2    0.069990
d  2   -1.181587
   3   -1.229886
dtype: float64

- In DataFrame, either axis can have a hierarchical index

In [14]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [18]:
frame.index

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [19]:
frame.columns

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           )

In [20]:
frame["Ohio"]

     Green  Red
a 1      0    1
  2      3    4
b 1      6    7
  2      9   10

In [21]:
frame.loc["a",:]

   Ohio     Colorado
  Green Red    Green
1     0   1        2
2     3   4        5

In [22]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [23]:
frame.sum(axis=1)

key1  key2
a     1        3
      2       12
b     1       21
      2       30
dtype: int64

## Database-style DataFrame Merges

- pandas.merge connects rows in DataFrames based on one or more keys.
- pandas.concat glues or stacks together objects along an axis.
- combine_first instance method enables splicing together overlapping data to fill in missing values in one object with values from another.

- Merge or join operations combine datasets by linking rows using one or more keys.
    - These operations are central to relational databases (e.g., SQL-based).

In [24]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': range(3)})

In [25]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [26]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [27]:
pd.merge(df1, df2) # natural join

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [28]:
df1.merge(df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [29]:
pd.merge(df1, df2, on='key') # join using the attribute specified in the "on" parameter

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [30]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                    'data2': range(3)})

In [31]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [32]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [33]:
pd.merge(df3,df4)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [34]:
#we can specify the join attributes on the left and right tables
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    a      2    a      0
3    a      4    a      0
4    a      5    a      0
5    b      6    b      1

In [35]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey', how='left')

  lkey  data1 rkey  data2
0    b      0    b    1.0
1    b      1    b    1.0
2    a      2    a    0.0
3    c      3  NaN    NaN
4    a      4    a    0.0
5    a      5    a    0.0
6    b      6    b    1.0

In [36]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey', how='right')

  lkey  data1 rkey  data2
0    a    2.0    a      0
1    a    4.0    a      0
2    a    5.0    a      0
3    b    0.0    b      1
4    b    1.0    b      1
5    b    6.0    b      1
6  NaN    NaN    d      2

In [37]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey', how='outer')

  lkey  data1 rkey  data2
0    a    2.0    a    0.0
1    a    4.0    a    0.0
2    a    5.0    a    0.0
3    b    0.0    b    1.0
4    b    1.0    b    1.0
5    b    6.0    b    1.0
6    c    3.0  NaN    NaN
7  NaN    NaN    d    2.0

In [38]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],
                     'lval': [1, 2, 3]})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      'key2': ['one', 'one', 'one', 'two'],
                      'rval': [4, 5, 6, 7]})

In [39]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [40]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [41]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  bar  one   3.0   6.0
1  bar  two   NaN   7.0
2  foo  one   1.0   4.0
3  foo  one   1.0   5.0
4  foo  two   2.0   NaN

- treatment of overlapping column names.
-  merge has a suffixes option for specifying strings to append to overlapping names in the left and right DataFrame objects

In [42]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [43]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

- Merging on Index
    - the merge key(s) in a DataFrame can be found in its index.

In [44]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                      'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [45]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [46]:
right1

   group_val
a        3.5
b        7.0

In [47]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0

In [48]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [49]:
pd.merge(right1, right1, left_index=True, right_index=True)

   group_val_x  group_val_y
a          3.5          3.5
b          7.0          7.0

In [50]:
#we can use the indexes on both tables

left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                     index=['a', 'c', 'e'],
                     columns=['Ohio', 'Nevada'])
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                      index=['b', 'c', 'd', 'e'],
                      columns=['Missouri', 'Alabama'])

In [51]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [52]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [53]:
pd.merge(left2, right2, left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

- DataFrame has a convenient **join** instance for merging by index
 - It performs a left join on the join keys, exactly preserving the left frames row index

In [54]:
left2.join(right2)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

In [55]:
pd.merge(left2, right2, left_index=True, right_index=True, how= 'left')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

In [56]:
right2.join(left2)

   Missouri  Alabama  Ohio  Nevada
b       7.0      8.0   NaN     NaN
c       9.0     10.0   3.0     4.0
d      11.0     12.0   NaN     NaN
e      13.0     14.0   5.0     6.0

In [57]:
left2.join(right2, how='inner')

   Ohio  Nevada  Missouri  Alabama
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

In [58]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [59]:
right1

   group_val
a        3.5
b        7.0

In [60]:
# we can join by index and attribute as with the merge
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [61]:
#joining more tables
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
                       index=['a', 'c', 'e', 'f'],
                       columns=['New York', 'Oregon'])
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [62]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

## Concatenating Along an Axis

- Another kind of data combination operation is referred to interchangeably as concatenation, binding, or stacking

In [63]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [64]:
np.concatenate([arr, arr])

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [65]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In the context of pandas objects such as Series and DataFrame, having labeled axes
enable you to further generalize array concatenation

In [66]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

In [67]:
s1

a    0
b    1
dtype: int64

In [68]:
s2

c    2
d    3
e    4
dtype: int64

In [69]:
s3

f    5
g    6
dtype: int64

In [70]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [71]:
pd.concat([s1,s2,s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [72]:
s4 = pd.concat([s1, s3])

In [73]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [74]:
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [75]:
s1

a    0
b    1
dtype: int64

In [76]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [77]:
pd.concat([s1, s4], axis=1, join ='inner')

   0  1
a  0  0
b  1  1

- A potential issue is that the concatenated pieces are not identifiable in the result.

In [78]:
pd.concat([s1,s2,s3], keys=['s1','s2','s3'])

s1  a    0
    b    1
s2  c    2
    d    3
    e    4
s3  f    5
    g    6
dtype: int64

In [79]:
pd.concat([s1,s2,s3], keys=['s1','s2','s3']).unstack()

      a    b    c    d    e    f    g
s1  0.0  1.0  NaN  NaN  NaN  NaN  NaN
s2  NaN  NaN  2.0  3.0  4.0  NaN  NaN
s3  NaN  NaN  NaN  NaN  NaN  5.0  6.0

- The same logic extends to DataFrame objects:

In [80]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
                   columns=['one', 'two'])
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
                   columns=['three', 'four'])

In [81]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [82]:
df2

   three  four
a      5     6
c      7     8

In [83]:
pd.concat([df1,df2])

   one  two  three  four
a  0.0  1.0    NaN   NaN
b  2.0  3.0    NaN   NaN
c  4.0  5.0    NaN   NaN
a  NaN  NaN    5.0   6.0
c  NaN  NaN    7.0   8.0

In [84]:
pd.concat([df1,df2], axis=1)

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0

In [85]:
pd.concat([df1,df2], axis=1, keys =['df1','df2'])

  df1       df2
  one two three four
a   0   1   5.0  6.0
b   2   3   NaN  NaN
c   4   5   7.0  8.0

- when the row index does not contain any relevant data

In [86]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [87]:
df1

          a         b         c         d
0  1.043197 -0.307120  0.857409  0.291031
1 -1.535754  1.903508  0.864872  0.424349
2 -0.326997 -0.624387  0.956877 -0.132009

In [88]:
df2

          b         d         a
0 -1.508460  0.344143 -0.672771
1  1.534602 -0.205387  0.000243

In [89]:
pd.concat([df1,df2])

          a         b         c         d
0  1.043197 -0.307120  0.857409  0.291031
1 -1.535754  1.903508  0.864872  0.424349
2 -0.326997 -0.624387  0.956877 -0.132009
0 -0.672771 -1.508460       NaN  0.344143
1  0.000243  1.534602       NaN -0.205387

In [90]:
pd.concat([df1,df2], ignore_index=True)

          a         b         c         d
0  1.043197 -0.307120  0.857409  0.291031
1 -1.535754  1.903508  0.864872  0.424349
2 -0.326997 -0.624387  0.956877 -0.132009
3 -0.672771 -1.508460       NaN  0.344143
4  0.000243  1.534602       NaN -0.205387

In [91]:
pd.concat([df1,df2], axis=1)

          a         b         c         d         b         d         a
0  1.043197 -0.307120  0.857409  0.291031 -1.508460  0.344143 -0.672771
1 -1.535754  1.903508  0.864872  0.424349  1.534602 -0.205387  0.000243
2 -0.326997 -0.624387  0.956877 -0.132009       NaN       NaN       NaN

# Data Aggregation and Group Operations

- Categorizing a dataset and applying a function to each group is often a critical component of a data analysis workflow.
- After loading, merging, and preparing a dataset, you may need to compute group statistics or pivot tables for reporting or visualization purposes.

### GroupBy Mechanics
- data contained in a pandas object is split into groups based on one or more keys.
    - The splitting is performed on a particular axis of an object.
        - For example, a DataFrame can be grouped on its rows (axis=0) or its columns (axis=1).
- a function is applied to each group, producing a new value.
- the results of all those function applications are combined into a result object.

<img src="https://drive.google.com/uc?id=1B559BfpzVoV6i9QdzmeA-GLrGdZTd-2s" width=500>

In [92]:
import pandas as pd
import numpy as np

In [93]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  1.401280  1.784130
1    a  two  0.790831 -0.142056
2    b  one  0.514405  0.898680
3    b  two -0.344214 -1.561110
4    a  one -0.379720 -0.489092

- We want to compute the mean of the data1 column using the labels from key1.

In [94]:
grouped = df['data1'].groupby(df['key1'])

In [95]:
grouped

- This grouped variable is now a GroupBy object.
- It has not actually computed anything yet except for some intermediate data about the group key df['key1'].
- The idea is that this object has all of the information needed to then apply some operation to each of the groups.

In [96]:
grouped.max()

key1
a    1.401280
b    0.514405
Name: data1, dtype: float64

In [97]:
grouped.mean()

key1
a    0.604130
b    0.085096
Name: data1, dtype: float64

In [98]:
grouped.sum()

key1
a    1.812391
b    0.170191
Name: data1, dtype: float64

In [99]:
df['data1'].groupby([df['key1'], df['key2']]).mean()

key1  key2
a     one     0.510780
      two     0.790831
b     one     0.514405
      two    -0.344214
Name: data1, dtype: float64

In [100]:
df['data1'].groupby([df['key1'], df['key2']]).mean().unstack()

key2       one       two
key1
a     0.510780  0.790831
b     0.514405 -0.344214

In [101]:
df

  key1 key2     data1     data2
0    a  one  1.401280  1.784130
1    a  two  0.790831 -0.142056
2    b  one  0.514405  0.898680
3    b  two -0.344214 -1.561110
4    a  one -0.379720 -0.489092

In [102]:
df.groupby(df['key1']).mean() #non funziona perch in df non tutte le colonne sono numeriche -> problema Nan

TypeError: agg function failed [how->mean,dtype->object]

In [105]:
df.groupby(df['key1']).mean(numeric_only=True)

         data1     data2
key1
a     0.604130  0.384327
b     0.085096 -0.331215

- Note that there is no key2 column in the result.
    - df['key2'] is not numeric data

    
    
- the method size returns a Series containing group sizes

In [106]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

- Iterating Over Groups
    - The GroupBy object supports iteration,
    - It generates a sequence of 2-tuples containing the group name along with the chunk of data

In [107]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)
    print("\n\n")

a
  key1 key2     data1     data2
0    a  one  1.401280  1.784130
1    a  two  0.790831 -0.142056
4    a  one -0.379720 -0.489092



b
  key1 key2     data1    data2
2    b  one  0.514405  0.89868
3    b  two -0.344214 -1.56111

In [108]:
# multiple keys in the group by clause
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)
    print("\n\n")

('a', 'one')
  key1 key2    data1     data2
0    a  one  1.40128  1.784130
4    a  one -0.37972 -0.489092



('a', 'two')
  key1 key2     data1     data2
1    a  two  0.790831 -0.142056



('b', 'one')
  key1 key2     data1    data2
2    b  one  0.514405  0.89868



('b', 'two')
  key1 key2     data1    data2
3    b  two -0.344214 -1.56111

- By default groupby groups on axis=0, but you can group on any of the other axes.

In [109]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [110]:
df

  key1 key2     data1     data2
0    a  one  1.401280  1.784130
1    a  two  0.790831 -0.142056
2    b  one  0.514405  0.898680
3    b  two -0.344214 -1.561110
4    a  one -0.379720 -0.489092

In [111]:
grouped = df.groupby(df.dtypes, axis=1)

/var/folders/d5/jd8cs2ds0lq81wp6tr68x7800000gn/T/ipykernel_30438/1565832547.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  grouped = df.groupby(df.dtypes, axis=1)

In [ ]:
grouped

In [ ]:
for dtype, group in grouped:
    print(dtype)
    print(group)

### Selecting a Column or Subset of Columns
- Indexing a GroupBy object created from a DataFrame with a column name or array of column names has the effect of column subsetting for aggregation

In [113]:
df.groupby('key1')['data1']
# it is equal to df['data1'].groupby(df['key1'])

In [114]:
df.groupby('key1')[['data2']]
# it is equal to df[['data2']].groupby(df['key1'])

In [115]:
df.groupby('key1')['data2'].mean()

key1
a    0.384327
b   -0.331215
Name: data2, dtype: float64

### Grouping with Dicts and Series

In [118]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [119]:
people

               a         b         c         d         e
Joe    -0.180266  3.549811 -0.736213  0.218935  1.349134
Steve   1.569007 -0.631179  1.387744  0.814628  1.004529
Wes     0.585591 -0.536179 -0.408406 -0.150787 -0.133191
Jim    -1.613440  0.250341  0.615188 -1.374887  0.335829
Travis  0.004733  0.650409 -0.416223 -0.906839  1.115359

In [120]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'orange'}

In [121]:
by_column = people.groupby(mapping, axis=1)

/var/folders/d5/jd8cs2ds0lq81wp6tr68x7800000gn/T/ipykernel_30438/953159321.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  by_column = people.groupby(mapping, axis=1)

In [122]:
by_column.sum()

            blue    orange       red
Joe    -0.517277  1.349134  3.369544
Steve   2.202373  1.004529  0.937828
Wes    -0.559193 -0.133191  0.049412
Jim    -0.759700  0.335829 -1.363099
Travis -1.323063  1.115359  0.655143

- The same functionality holds for Series, which can be viewed as a fixed-size mapping

In [ ]:
map_series = pd.Series(mapping)

In [ ]:
map_series

In [ ]:
by_columnSeries = people.groupby(map_series, axis=1)

In [ ]:
by_columnSeries.mean()

### Grouping with Functions
- Any function passed as a group key will be called once per index value, with the return values being used as the group names.

In [123]:
people

               a         b         c         d         e
Joe    -0.180266  3.549811 -0.736213  0.218935  1.349134
Steve   1.569007 -0.631179  1.387744  0.814628  1.004529
Wes     0.585591 -0.536179 -0.408406 -0.150787 -0.133191
Jim    -1.613440  0.250341  0.615188 -1.374887  0.335829
Travis  0.004733  0.650409 -0.416223 -0.906839  1.115359

In [125]:
people.groupby(len).sum()

          a         b         c         d         e
3 -1.208115  3.263973 -0.529431 -1.306738  1.551773
5  1.569007 -0.631179  1.387744  0.814628  1.004529
6  0.004733  0.650409 -0.416223 -0.906839  1.115359

In [126]:
def name_with_j(x):
  if x.startswith("J"):
    return True
  return False

In [127]:
name_with_j("Jim")

True

In [128]:
name_with_j("Albert")

False

In [129]:
people.groupby(name_with_j).sum()

              a         b         c         d         e
False  2.159332 -0.516949  0.563115 -0.242998  1.986697
True  -1.793707  3.800152 -0.121025 -1.155952  1.684964

- Mixing functions with arrays, dicts, or Series is not a problem

In [130]:
people

               a         b         c         d         e
Joe    -0.180266  3.549811 -0.736213  0.218935  1.349134
Steve   1.569007 -0.631179  1.387744  0.814628  1.004529
Wes     0.585591 -0.536179 -0.408406 -0.150787 -0.133191
Jim    -1.613440  0.250341  0.615188 -1.374887  0.335829
Travis  0.004733  0.650409 -0.416223 -0.906839  1.115359

In [131]:
key_list = ['one', 'one', 'one', 'two', 'two']
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.180266 -0.536179 -0.736213 -0.150787 -0.133191
  two -1.613440  0.250341  0.615188 -1.374887  0.335829
5 one  1.569007 -0.631179  1.387744  0.814628  1.004529
6 two  0.004733  0.650409 -0.416223 -0.906839  1.115359

### Data Aggregation

<img src="https://drive.google.com/uc?id=1Azj6fJq9KLaSZoA0GSLl2OwJCUzw-Ba2" width=500>

- Aggregations refer to any data transformation that produces scalar values from arrays.

- Many common aggregations, such as those found in the above table, have optimized implementations.

- You are not limited to only this set of methods.
    - For example quantile is not explicitly implemented for GroupBy, it is a Series method and thus available for use.

In [132]:
grouped = df.groupby('key1')
grouped['data1'].quantile()

key1
a    0.790831
b    0.085096
Name: data1, dtype: float64

-  you can implement a custom function
- you have to pass the function to the agg() method

In [133]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [134]:
grouped = df.groupby('key1')

In [135]:
grouped['data1'].agg(peak_to_peak)

key1
a    1.781000
b    0.858619
Name: data1, dtype: float64

In [136]:
#Note that the method describes works applied to groups
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.604130  0.905060 -0.379720  0.205555  0.790831  1.096055
b      2.0  0.085096  0.607135 -0.344214 -0.129559  0.085096  0.299750

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.401280   3.0  0.384327  1.224620 -0.489092 -0.315574 -0.142056
b     0.514405   2.0 -0.331215  1.739334 -1.561110 -0.946163 -0.331215


           75%      max
key1
a     0.821037  1.78413
b     0.283733  0.89868

## [BONUS] Column-Wise and Multiple Function Application

In [138]:
#caricare il file su colab
tips = pd.read_csv('tips.csv')

In [139]:
tips.head(10)

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4
5       25.29  4.71     No  Sun  Dinner     4
6        8.77  2.00     No  Sun  Dinner     2
7       26.88  3.12     No  Sun  Dinner     4
8       15.04  1.96     No  Sun  Dinner     2
9       14.78  3.23     No  Sun  Dinner     2

In [ ]:
tips.shape

In [ ]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [ ]:
tips.head(10)

- aggregating a Series or all of the columns of a DataFrame is a matter of using aggregate with the desired function or calling a method like mean or std.
- you may want to aggregate using a different function depending on the column, or multiple functions at once.

In [ ]:
#this is a simple grouping
grouped = tips.groupby(['day', 'smoker'])

In [ ]:
grouped_pct = grouped['tip_pct']

In [ ]:
# for simple statistics, you can pass the name of the function as a string
grouped_pct.agg('mean')

In [ ]:
grouped_pct.mean()

In [ ]:
# If you pass a list of functions or function names, you get back a DataFrame with column names taken from the functions
grouped_pct.agg(['mean', 'std', peak_to_peak])

In [ ]:
grouped_pct.agg([('Media', 'mean'), ('Deviazione std', np.std)])

In [ ]:
#you can specify a list of functions to apply to all of the columns or different functions per column
#all columns
functions = ['count', 'mean', 'max']

In [ ]:
grouped[['tip_pct', 'total_bill']].agg(functions)

In [ ]:
#aggregation on a selection of the columns

In [ ]:
grouped.agg({'tip' : np.max, 'size' : 'sum'})

## [BONUS] Apply: General split-apply-combine

- We want to select the top five values by group

In [ ]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [ ]:
top(tips, n=6)

In [ ]:
tips[["day","total_bill"]].groupby(["day"]).max()

In [ ]:
tips[["day","total_bill"]].groupby("day").apply(top, column="total_bill")

In [ ]:
tips[["day","total_bill"]].groupby("day").apply(top, n=1, column="total_bill")

## Pivot Tables

- A pivot table
    - aggregates a table of data by one or more keys,
    - arranges the data in a rectangle with some of the group keys along the rows and the columns.

In [140]:
#caricare il file su colab
tips = pd.read_csv('tips.csv')

In [143]:
tips.head(10)

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4
5       25.29  4.71     No  Sun  Dinner     4
6        8.77  2.00     No  Sun  Dinner     2
7       26.88  3.12     No  Sun  Dinner     4
8       15.04  1.96     No  Sun  Dinner     2
9       14.78  3.23     No  Sun  Dinner     2

In [144]:
tips.pivot_table(index=['day', 'smoker']) # the default aggregation type is mean

TypeError: agg function failed [how->mean,dtype->object]

In [146]:
tips.pivot_table(index=['day', 'smoker'], aggfunc='first')

             size    time   tip  total_bill
day  smoker
Fri  No         2  Dinner  3.50       22.49
     Yes        2  Dinner  3.00       28.97
Sat  No         3  Dinner  3.35       20.65
     Yes        4  Dinner  3.00       38.01
Sun  No         2  Dinner  1.01       16.99
     Yes        2  Dinner  3.00       17.51
Thur No         4   Lunch  4.00       27.20
     Yes        2   Lunch  3.00       19.44

In [149]:
tips.pivot_table(index=['day', 'smoker'], values=['size', 'tip'], aggfunc='sum')

             size     tip
day  smoker
Fri  No         9   11.25
     Yes       31   40.71
Sat  No       115  139.63
     Yes      104  120.77
Sun  No       167  180.57
     Yes       49   66.82
Thur No       112  120.32
     Yes       40   51.51

In [153]:
tips.pivot_table(index=['day', 'size'], values='tip', columns='smoker')

smoker           No       Yes
day  size
Fri  1          NaN  1.920000
     2     2.750000  2.620000
     3     3.000000       NaN
     4          NaN  4.730000
Sat  1     1.000000  1.000000
     2     2.563200  2.476786
     3     3.412500  4.568333
     4     4.800000  3.335000
     5          NaN  3.000000
Sun  2     2.582222  3.345000
     3     2.937273  3.625000
     4     3.962500  5.090000
     5     5.070000  2.000000
     6     5.000000       NaN
Thur 1     1.830000       NaN
     2     2.341714  2.713846
     3     1.770000  3.615000
     4     4.030000  4.500000
     5     5.000000       NaN
     6     5.300000       NaN

In [154]:
tips.pivot_table(index=['day', 'size'], values='tip', columns='smoker', margins=True)

smoker           No       Yes       All
day  size
Fri  1          NaN  1.920000  1.920000
     2     2.750000  2.620000  2.644375
     3     3.000000       NaN  3.000000
     4          NaN  4.730000  4.730000
Sat  1     1.000000  1.000000  1.000000
     2     2.563200  2.476786  2.517547
     3     3.412500  4.568333  3.797778
     4     4.800000  3.335000  4.123846
     5          NaN  3.000000  3.000000
Sun  2     2.582222  3.345000  2.816923
     3     2.937273  3.625000  3.120667
     4     3.962500  5.090000  4.087778
     5     5.070000  2.000000  4.046667
     6     5.000000       NaN  5.000000
Thur 1     1.830000       NaN  1.830000
     2     2.341714  2.713846  2.442500
     3     1.770000  3.615000  2.692500
     4     4.030000  4.500000  4.218000
     5     5.000000       NaN  5.000000
     6     5.300000       NaN  5.300000
All        2.991854  3.008710  2.998279

In [155]:
tips.pivot_table(index=['day', 'size'], values='tip', columns='smoker', margins=True, fill_value=-1000)

smoker              No          Yes       All
day  size
Fri  1    -1000.000000     1.920000  1.920000
     2        2.750000     2.620000  2.644375
     3        3.000000 -1000.000000  3.000000
     4    -1000.000000     4.730000  4.730000
Sat  1        1.000000     1.000000  1.000000
     2        2.563200     2.476786  2.517547
     3        3.412500     4.568333  3.797778
     4        4.800000     3.335000  4.123846
     5    -1000.000000     3.000000  3.000000
Sun  2        2.582222     3.345000  2.816923
     3        2.937273     3.625000  3.120667
     4        3.962500     5.090000  4.087778
     5        5.070000     2.000000  4.046667
     6        5.000000 -1000.000000  5.000000
Thur 1        1.830000 -1000.000000  1.830000
     2        2.341714     2.713846  2.442500
     3        1.770000     3.615000  2.692500
     4        4.030000     4.500000  4.218000
     5        5.000000 -1000.000000  5.000000
     6        5.300000 -1000.000000  5.300000
All           2.991854     3.008710  2.998279

## [Bonus] Cross-Tabulations: Crosstab
- A cross-tabulation (or crosstab for short) is a special case of a pivot table that computes group frequencies.

In [ ]:
states= ['USA','USA','UK','IT','UK','UK','IT','USA']
gender= ['M','F','F','M','M','M','F','M']

In [ ]:
data = pd.DataFrame({'states':states,'gender':gender})

In [ ]:
data

In [ ]:
pd.crosstab(data.states, data.gender)

In [ ]:
pd.crosstab(data.gender, data.states)

In [ ]:
pd.crosstab(data.gender, data.states, margins=True)